package com.company;

public class Biblioteka {
}


//В библиотеке имеются отделы (художественной, юридической, технической литературы).
//
//        В каждом отделе есть свои книги
//        У отделов должны быть следующие методы:
//        1. Добавление новой книги
//        2. Вывод на консоль всех книг отдела
//        3. Вывод на консоль всей информации отдела (включая все книги)
//        4. Поиск книги по автору в отделе
//        5. Метод для получения количества книг в любом из отделов
//        6. Каждый отдел выводит свое название и количество книг при вызове toString()
//        7. У отдела технической литературы должно быть свойство "наличие компьютера"
//
//        Книга имеет идентификатор, автора, наименование, год выпуска.

